{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"stateful": false, "go_backwards": false, "kernel_constraint": null, "activation": "tanh", "dtype": "float32", "name": "lstm_1", "bias_constraint": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "activity_regularizer": null, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "return_sequences": false, "batch_input_shape": [null, 20, 1215], "use_bias": true, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "unroll": false, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "dropout": 0.0}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "units": 1215, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}], "backend": "tensorflow", "keras_version": "2.1.1"}