{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "unroll": false, "implementation": 1, "go_backwards": false, "bias_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "batch_input_shape": [null, 20, 1215], "units": 128, "trainable": true, "recurrent_regularizer": null, "kernel_constraint": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "stateful": false, "return_sequences": false, "bias_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1215, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.1.1", "class_name": "Sequential"}